0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (1 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        inletValue      uniform (0 0 0);
        value           uniform (0 0 0);
    }

    blades
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    shaft
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    struts
    {
        type            movingWallVelocity;
        value           uniform (0 0 0);
    }

    walls
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    top
    {
        type            slip;
    }

    bottom
    {
        type            fixedValue;
        value           uniform (1 0 0);
    }

    AMI1
    {
        type  		cyclicAMI;
        value   	$internalField;
    }

    AMI2
    {
        type  		cyclicAMI;
        value   	$internalField;
    }

    "proc.*"
    {
        type            processor;
    }

}


// ************************************************************************* //
